**Pandas Series Methods**

In [2]:
import numpy as np
import pandas as pd

In [3]:
## Method1 : astype()
s = pd.Series([1,2,3,4])
print(s.dtype)

s_float = s.astype(float)
print(s_float)
print(s_float.dtype)

int64
0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64
float64

In [4]:
string_series = pd.Series(['10','20','30','40'])
int_series = string_series.astype(int)
print(int_series.dtype)

int64

In [5]:
nums_series  = pd.Series(np.arange(1,10))
bool_series = nums_series.astype(bool)
print(bool_series)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
dtype: bool

In [6]:
## between() - Range Checking
vk_runs = pd.read_csv('kohli_ipl.csv')
vk_runs = vk_runs.set_index('match_no')['runs']
vk_runs

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [7]:
## checking the half centuries
half_centuries = vk_runs.between(50,99)
vk_runs[half_centuries]

match_no
15     50
34     58
41     71
44     56
45     67
52     70
57     57
68     73
71     51
73     58
74     65
80     57
81     93
82     99
85     56
97     67
99     73
103    51
104    62
110    82
116    75
117    79
119    80
122    52
127    75
129    54
131    54
132    62
134    64
137    55
141    58
144    57
145    92
148    68
152    70
160    84
162    67
175    72
178    90
182    50
188    72
197    51
198    53
209    58
213    73
Name: runs, dtype: int64

In [8]:
## how much centuries has vk scored
vk_runs[vk_runs >= 100]

match_no
120    100
123    108
126    109
128    113
164    100
Name: runs, dtype: int64

In [9]:
## clip()
#Values < lower bound → replaced with lower bound
#Values > upper bound → replaced with upper bound

nums_series = pd.Series([10,20,50,60,90,120])
print(nums_series.clip(50,90))

0    50
1    50
2    50
3    60
4    90
5    90
dtype: int64

**Methods useful for data cleaning**
1. drop_duplicates()
2. duplicated()
3. isnull()
4. dropna()
5. fillna()

In [10]:
## drop_duplicates()
s1 = pd.Series([1,2,2,3,3,3,4,4,4,4])
s1.drop_duplicates(keep = 'last') # remove the earlier occurance of element and keep the last one

0    1
2    2
5    3
9    4
dtype: int64

In [11]:
## duplicated() -> boolean series which returns true if value is duplicated
s1.duplicated().sum() # total six items are duplicated or repeated

np.int64(6)

In [12]:
##  isnull
s3 = pd.Series([1,2,3,np.nan,5,6,np.nan,8,9,np.nan])
s3

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
6    NaN
7    8.0
8    9.0
9    NaN
dtype: float64

In [13]:
s3.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9     True
dtype: bool

In [14]:
## dropna: drop all the missing values
s3.dropna()

0    1.0
1    2.0
2    3.0
4    5.0
5    6.0
7    8.0
8    9.0
dtype: float64

In [15]:
## fillna: fill null values

person_age = pd.Series([50,45,20,np.nan,62,np.nan])
person_age = person_age.fillna(person_age.mean())

In [16]:
person_age

0    50.00
1    45.00
2    20.00
3    44.25
4    62.00
5    44.25
dtype: float64

In [17]:
## membership operator isin -> returns a boolean series
person_name = pd.Series(['shravan' , 'ayush' , 'mohit' , 'akshay' , 'sahil'])

person_name.isin(['shravan' , 'sahil' , 'ayush']) # are these names present in the series

0     True
1     True
2    False
3    False
4     True
dtype: bool

In [18]:
person_name[person_name.isin(['shravan' , 'sahil' , 'ayush'])]

0    shravan
1      ayush
4      sahil
dtype: object

In [19]:
## apply() -> allows the user to implement custom logic
movies_data = pd.read_csv('bollywood.csv')
movies_data = movies_data.set_index('movie')['lead']

In [22]:
## applying the logic that the lead actor name should be in capital case
movies_data.apply(lambda x:x.upper()).values

array(['VICKY KAUSHAL', 'VICKY AHUJA', 'ANUPAM KHER', ..., 'VIVEK OBEROI',
       'AJAY DEVGN', 'AKSHAY KUMAR'], dtype=object)

In [28]:
daily_steps = pd.read_csv('steps_data.csv')
daily_steps = daily_steps.set_index('Day')['Steps']

In [30]:
## custom logic using apply: if no of steps > 6000 then good else bad
daily_steps.apply(lambda x: 'Good' if x > 6000 else 'Bad')

Day
Monday        Bad
Tuesday      Good
Wednesday     Bad
Thursday     Good
Friday       Good
Saturday     Good
Sunday       Good
Name: Steps, dtype: object

When we use head or tail function, we get a view not a copy of the series , any changes made in the head or tail function will affet the original one,
so it is always better to make a copy of original one before making changes

In [36]:
vk_runs_copy = vk_runs.head().copy()

In [37]:
vk_runs_copy

match_no
1     1
2    23
3    13
4    12
5     1
Name: runs, dtype: int64

In [38]:
vk_runs_copy[1] = 24
vk_runs

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [ ]:
## ----------------end of series , To start dataframe-----------------------